In [1]:
import pandas as pd

In [2]:
dat=pd.read_csv("C:\\Users\\Sai\\Downloads\\DataSets\\nyc_weather.csv")

In [3]:
dat.head(5)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [5]:
#get maximum temperature
dat['Temperature'].max()

50

In [6]:
#on which days did it rain
dat['Events'].unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

In [9]:
dat[dat['Events']=='Rain']['EST']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [10]:
#OR
dat['EST'][dat['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [11]:
#avg wind speed
dat['WindSpeedMPH'].mean()

6.892857142857143

In [12]:
#pip3 install pandas

In [13]:
dat.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [14]:
dat[2:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [15]:
dat.EST  #OR dat['EST']

0      1/1/2016
1      1/2/2016
2      1/3/2016
3      1/4/2016
4      1/5/2016
5      1/6/2016
6      1/7/2016
7      1/8/2016
8      1/9/2016
9     1/10/2016
10    1/11/2016
11    1/12/2016
12    1/13/2016
13    1/14/2016
14    1/15/2016
15    1/16/2016
16    1/17/2016
17    1/18/2016
18    1/19/2016
19    1/20/2016
20    1/21/2016
21    1/22/2016
22    1/23/2016
23    1/24/2016
24    1/25/2016
25    1/26/2016
26    1/27/2016
27    1/28/2016
28    1/29/2016
29    1/30/2016
30    1/31/2016
Name: EST, dtype: object

In [16]:
dat[['EST','Temperature']].head(5)

        EST  Temperature
0  1/1/2016           38
1  1/2/2016           36
2  1/3/2016           40
3  1/4/2016           25
4  1/5/2016           20

In [17]:
dat['Temperature'].describe()

count    31.000000
mean     34.677419
std       7.639315
min      20.000000
25%      29.000000
50%      35.000000
75%      39.500000
max      50.000000
Name: Temperature, dtype: float64

In [23]:
#select a row which has maximum temperature
dat[dat['Temperature']==dat['Temperature'].max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [27]:
#select only day column which has maximum temperature
dat.EST[dat.Temperature==dat.Temperature.max()]

9    1/10/2016
Name: EST, dtype: object

In [28]:
#pip3 install xlrd
#df = pd.read_excel(" ")

In [ ]:
#write to csv
df.to_csv(" ")
df.to_csv("",index=False)

In [ ]:
#pip3 install openpyxl
#write DF to excel
df.to_excel(" ",sheet_name=" ")

In [33]:
df=pd.read_csv("C:\\Users\\Sai\\Downloads\\DataSets\\weather_data_cities.csv")
df.head(2)

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny

In [36]:
g=df.groupby('city')
g

In [38]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [40]:
print(g.get_group('new york'))   #to get a specific group

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [41]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [42]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [44]:
df.describe()

       temperature  windspeed
count    12.000000  12.000000
mean     56.166667  10.000000
std      25.044808   4.572646
min      28.000000   5.000000
25%      35.250000   6.750000
50%      47.500000   9.000000
75%      85.500000  12.250000
max      92.000000  20.000000

In [45]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [48]:
#concatenate data frames
india_weather = pd.DataFrame({'city':['mumbai','delhi','bangalore'],
                            'temperature':[32,45,30],
                            'humidity':[80,60,78]})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [49]:
us_weather =pd.DataFrame({'city':['new york','chicago','orlando'],'temperature':[21,14,35],'humidity':[68,65,75]})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [53]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [55]:
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [56]:
df=pd.concat([india_weather,us_weather],axis=1)
df

        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           21        68
1      delhi           45        60   chicago           14        65
2  bangalore           30        78   orlando           35        75

In [58]:
#merging
temp_df =pd.DataFrame({'city':['delhi','mumbai','bangalore','hyderabad'],'temperature':[38,45,30,40]})
temp_df

        city  temperature
0      delhi           38
1     mumbai           45
2  bangalore           30
3  hyderabad           40

In [59]:
humidity_df = pd.DataFrame({'city':['delhi','mumbai','bangalore'],'humidity':[68,65,75]})
humidity_df

        city  humidity
0      delhi        68
1     mumbai        65
2  bangalore        75

In [61]:
df=pd.merge(temp_df,humidity_df,on='city')
df

        city  temperature  humidity
0      delhi           38        68
1     mumbai           45        65
2  bangalore           30        75

In [63]:
#outerjoin
df=pd.merge(temp_df,humidity_df,on='city',how='outer')
df

        city  temperature  humidity
0      delhi           38      68.0
1     mumbai           45      65.0
2  bangalore           30      75.0
3  hyderabad           40       NaN

In [65]:
#numerical indexing (.loc and iloc)
df=pd.DataFrame([1,2,3,4,5,6,7,8])
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [72]:
df=pd.DataFrame([1,2,3,4,5,6,7,8],index =[49,48,47,45,1,2,3,4])
df

    0
49  1
48  2
47  3
45  4
1   5
2   6
3   7
4   8

In [73]:
df.loc[48]

0    2
Name: 48, dtype: int64

In [77]:
df.iloc[7]

0    8
Name: 4, dtype: int64

In [70]:
df.loc[:2]

    0
49  1
48  2
47  3
45  4
1   5
2   6